In [ ]:
# init
import sqlite3
import csv

## DB 만들기
### Example를 수행하기 위해 교육 사이트에서 제공하는 DB 쿼리를 CSV파일로 저장한 후 직접 DB파일을 만들어 과제를 수행하였습니다.
* reference : https://www.w3schools.com/sql/trysql.asp?filename=trysql_customers

In [ ]:
## init db
csv_file = 'colors.csv'

conn = sqlite3.connect('test2.db')
cursor = conn.cursor()


table = ['Customers', 'Categories', 'Employees', 'OrderDetails', 'Orders', 'Products', 'Shippers', 'Suppliers']
# 'INTEGER'
# 'TEXT'
# 'BOOL'
features = {'Customers' : ['CustomerID INTEGER PRIMARY KEY', 'CustomerName TEXT', 'ContactName TEXT', 'Address TEXT', 'City TEXT', 'PostalCode TEXT', 'Country TEXT'],
            'Categories' : ['CategoryID INTEGER PRIMARY KEY', 'CategoryName TEXT','Description TEXT'], 
            'Employees' : ['EmployeeID INTEGER PRIMARY KEY',    'LastName TEXT',    'FirstName TEXT',   'BirthDate TEXT',   'Photo TEXT',   'Notes TEXT'], 
            'OrderDetails' : ['OrderDetailID INTEGER PRIMARY KEY',  'OrderID TEXT', 'ProductID TEXT',   'Quantity INTEGER'], 
            'Orders' : ['OrderID INTEGER PRIMARY KEY',  'CustomerID TEXT',  'EmployeeID TEXT',  'OrderDate TEXT',   'ShipperID TEXT'],
            'Products' : ['ProductID INTEGER PRIMARY KEY',  'ProductName TEXT', 'SupplierID TEXT',  'CategoryID TEXT',  'Unit TEXT',    'Price FLOAT'], 
            'Shippers' : ['ShipperID INTEGER PRIMARY KEY',  'ShipperName TEXT', 'Phone TEXT'], 
            'Suppliers' : ['SupplierID INTEGER PRIMARY KEY',    'SupplierName TEXT',    'ContactName TEXT', 'Address TEXT', 'City TEXT',    'PostalCode TEXT',  'Country TEXT', 'Phone TEXT']}

header = {'Customers' : ['CustomerID', 'CustomerName', 'ContactName', 'Address', 'City', 'PostalCode', 'Country'],
            'Categories' : ['CategoryID', 'CategoryName','Description'], 
            'Employees' : ['EmployeeID', 'LastName',  'FirstName',    'BirthDate',    'Photo',    'Notes'], 
            'OrderDetails' : ['OrderDetailID', 'OrderID',    'ProductID',    'Quantity'], 
            'Orders' : ['OrderID', 'CustomerID',   'EmployeeID',   'OrderDate',    'ShipperID'],
            'Products' : ['ProductID', 'ProductName',    'SupplierID',   'CategoryID',   'Unit', 'Price'], 
            'Shippers' : ['ShipperID', 'ShipperName',    'Phone'], 
            'Suppliers' : ['SupplierID', 'SupplierName',  'ContactName',  'Address',  'City', 'PostalCode',   'Country',  'Phone']}


for table_name in table:
    feature_string = ', '.join(features[table_name])
    create_table_sql = f"""
CREATE TABLE IF NOT EXISTS {table_name} (
    {feature_string}
);
"""
    cursor.execute(create_table_sql)

    csv_file = f'rawdata/{table_name}.csv'
    print(table_name)
    with open(csv_file, 'r', newline='', encoding='utf-8') as f:
        reader = csv.reader(f)
        para = ['?' for _ in range(len(header[table_name]))]
        next(reader)  # 첫 줄은 헤더이므로 건너뜁니다.
        for row in reader:
            print(', '.join(header[table_name]))
            print(', '.join(para))
            cursor.execute(f'INSERT INTO {table_name} ({', '.join(header[table_name])}) VALUES ({', '.join(para)})', row)
    conn.commit()

conn.close()

In [ ]:
############### test.db
###############
## init db

# csv_file = 'colors.csv'
# conn = sqlite3.connect('test.db')
# cursor = conn.cursor()
# create_table_sql = """
# CREATE TABLE IF NOT EXISTS data (
#     id INTEGER PRIMARY KEY,
#     name TEXT,
#     rgb INTEGER,
#     is_trans BOOL
# );
# """

# cursor.execute(create_table_sql)

# with open(csv_file, 'r', newline='', encoding='utf-8') as f:
#     reader = csv.reader(f)
#     next(reader)  # 첫 줄은 헤더이므로 건너뜁니다.
#     for row in reader:
#         cursor.execute('INSERT INTO data (id, name, rgb, is_trans) VALUES (?, ?, ?, ?)', row)

# # 변경사항 저장
# conn.commit()

# # 연결 닫기
# conn.close()

In [ ]:
# connection object 는 context manager입니다.
conn = sqlite3.connect('test.db')
cur = conn.cursor()
cur.execute('select * from data')
rows = cur.fetchall()

for i in rows:
    print(i)

conn.close()

In [ ]:
# with 절을 사용하여 자동으로 close 할 수 있음
# with 절에 대하여 자세히 알아보기
with sqlite3.connect('test.db') as conn:
    cur = conn.cursor()
    cur.execute('select * from data')
    rows = cur.fetchall()

    for row in rows:
        print(row)

In [ ]:
# to make the code reusable
# can define a function

def get_task_by_id(id):
    try:
        with sqlite3.connect('test.db') as conn:
            cur = conn.cursor()
            cur.execute('select * from data where id =?', (id,))
            row = cur.fetchone()
            if row:
                print(row)
                #return row
    except sqlite3.Error as e:
        print('error')
        print(e)

get_task_by_id(10)

# Tutorial

* Example
```sql
SELECT * FROM _data;
```

In [ ]:
with sqlite3.connect('test.db') as conn:
    cur = conn.cursor()
    cur.execute('select * from data')
    rows = cur.fetchall()

    for row in rows:
        print(row)

# Tutorial

* Example
```sql
SELECT DISTINCT * FROM _data;
```

In [ ]:
# db : test.db
# table : data
# attribute : id, name, rgb, is_trans
with sqlite3.connect('test.db') as conn:
    cur = conn.cursor()
    cur.execute('SELECT DISTINCT rgb from data')
    rows = cur.fetchall()

    for row in rows:
        print(row)
    print(len(rows))

In [ ]:
# db : test.db
# table : data
# attribute : id, name, rgb, is_trans
with sqlite3.connect('test.db') as conn:
    cur = conn.cursor()
    cur.execute('SELECT rgb from data')
    rows = cur.fetchall()

    for row in rows:
        print(row)
    print(len(rows))

* Example
```sql
SELECT COUNT(DISTINCT Country) FROM Customers;


SELECT Count(*) AS DistinctCountries
FROM (SELECT DISTINCT Country FROM Customers);
```

In [ ]:
with sqlite3.connect('test.db') as conn:
    cur = conn.cursor()
    cur.execute('SELECT COUNT(DISTINCT rgb) FROM data;')
    rows = cur.fetchall()

    for row in rows:
        print(row)

In [ ]:
with sqlite3.connect('test.db') as conn:
    cur = conn.cursor()
    cur.execute('SELECT Count(*) AS DistinctRgb \
                FROM (SELECT DISTINCT rgb FROM data);')
    rows = cur.fetchall()

    for row in rows:
        print(row)

* Example
```sql
SELECT * FROM Customers
WHERE Country='Mexico';
```

In [ ]:
with sqlite3.connect('test.db') as conn:
    cur = conn.cursor()
    cur.execute("SELECT * FROM data \
                WHERE rgb='000000';")
    rows = cur.fetchall()

    for row in rows:
        print(row)

* Example
```sql
SELECT * FROM Customers
WHERE CustomerID=1;
```

In [ ]:
with sqlite3.connect('test.db') as conn:
    cur = conn.cursor()
    cur.execute("SELECT * FROM data \
                WHERE id=2;")
    rows = cur.fetchall()

    for row in rows:
        print(row)

* Example
```sql
SELECT * FROM Customers
WHERE CustomerID > 80;
```

In [ ]:
with sqlite3.connect('test.db') as conn:
    cur = conn.cursor()
    cur.execute("SELECT * FROM data \
                WHERE id > 500;")
    rows = cur.fetchall()

    for row in rows:
        print(row)

In [ ]:
## 쿼리문을 수행하고 수행 결과를 메모리에 적재시켜 출력하는 과정을 모듈화 해보겠습니다.
def execute_sql(sql_text):
    with sqlite3.connect('test.db') as conn:
        cur = conn.cursor()
        cur.execute(sql_text)
        rows = cur.fetchall()

        for row in rows:
            print(row)

def execute_sql_db(sql_text, db):
    with sqlite3.connect(db) as conn:
        cur = conn.cursor()
        cur.execute(sql_text)
        rows = cur.fetchall()

        for row in rows:
            print(row)

### The ORDER BY keyword is used to sort the result-set in ascending or descending order.
* Example
```sql
SELECT * FROM Products
ORDER BY Price;
```

In [ ]:
execute_sql('SELECT * FROM data ORDER BY id;')

* Example
```sql
SELECT * FROM Products
ORDER BY Price DESC;
```

In [ ]:
execute_sql('SELECT *\
             FROM data\
             ORDER BY id DESC;')

### For string values the ORDER BY keyword will order alphabetically
* Example
```sql
SELECT * FROM Products
ORDER BY ProductName;
```

In [ ]:
execute_sql('SELECT * FROM data\
             ORDER BY rgb;')

### To sort the table reverse alphabetically, use the DESC keyword:
* Example
```sql
SELECT * FROM Products
ORDER BY ProductName DESC;
```

In [ ]:
execute_sql("SELECT * \
             FROM data\
             ORDER BY rgb DESC;")

### ORDER BY Several Columns
##### The following SQL statement selects all customers from the "Customers" table, sorted by the "Country" and the "CustomerName" column. This means that it orders by Country, but if some rows have the same Country, it orders them by CustomerName:

* Example
```sql
SELECT * FROM Customers
ORDER BY Country, CustomerName;
```

In [ ]:
execute_sql("SELECT * \
            FROM data\
            ORDER BY id, name;")

### Using Both ASC and DESC
#### The following SQL statement selects all customers from the "Customers" table, sorted ascending by the "Country" and descending by the "CustomerName" column:

* Example
```sql
SELECT * FROM Customers
ORDER BY Country ASC, CustomerName DESC;
```

In [ ]:
execute_sql("SELECT *\
             FROM data\
             ORDER BY id ASC, rgb DESC;")

## SQL AND Operator

### The SQL AND Operator
- The WHERE clause can contain one or many AND operators.
- The AND operator is used to filter records based on more than one condition, like if you want to return all customers from Spain that starts with the letter 'G':

### AND vs OR
- The AND operator displays a record if all the conditions are TRUE.
- The OR operator displays a record if any of the conditions are TRUE.

### Combining AND and OR
- You can combine the AND and OR operators.

In [ ]:
execute_sql_db("SELECT *\
FROM Customers \
WHERE Country = 'Spain' AND CustomerName LIKE 'G%';", 'test2.db')

In [ ]:
execute_sql_db("SELECT * \
FROM Customers \
WHERE Country = 'Germany' \
AND City = 'Berlin' \
AND PostalCode > 12000;","test2.db")

In [ ]:
execute_sql_db("SELECT * \
               FROM Customers \
WHERE Country = 'Spain' AND (CustomerName LIKE 'G%' OR CustomerName LIKE 'R%');\
               ","test2.db")

In [ ]:
execute_sql_db(
    "\
    SELECT * \
    FROM Customers \
    WHERE Country = 'Spain' AND CustomerName LIKE 'G%' OR CustomerName LIKE 'R%';\
    ",
    "test2.db"
)

## SQL OR Operator

In [ ]:
execute_sql_db(
    """
    SELECT *
    FROM Customers
    WHERE Country = 'Germany' OR Country = 'Spain';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE City = 'Berlin' OR CustomerName LIKE 'G%' OR Country = 'Norway';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE Country = 'Spain' AND (CustomerName LIKE 'G%' OR CustomerName LIKE 'R%');
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE Country = 'Spain' AND CustomerName LIKE 'G%' OR CustomerName LIKE 'R%';
    """,
    "test2.db"
)

## SQL NOT Operator

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE NOT Country = 'Spain';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName NOT LIKE 'A%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerID NOT BETWEEN 10 AND 60;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE City NOT IN ('Paris', 'London');
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE NOT CustomerID > 50;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE NOT CustomerId < 50;
    """,
    "test2.db"
)

## SQL INSERT INTO Statement

In [ ]:
execute_sql_db(
    """
    INSERT INTO Customers (CustomerName, City, Country)
    VALUES ('Cardinal', 'Stavanger', 'Norway');
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    INSERT INTO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
    VALUES
    ('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway'),
    ('Greasy Burger', 'Per Olsen', 'Gateveien 15', 'Sandnes', '4306', 'Norway'),
    ('Tasty Tee', 'Finn Egan', 'Streetroad 19B', 'Liverpool', 'L1 0AA', 'UK');
    """,
    "test2.db"
)

## SQL NULL Values

In [ ]:
execute_sql_db(
    """
    SELECT CustomerName, ContactName, Address
    FROM Customers
    WHERE Address IS NULL;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT CustomerName, ContactName, Address
    FROM Customers
    WHERE Address IS NOT NULL;
    """,
    "test2.db"
)

## SQL UPDATE Statement

In [ ]:
execute_sql_db(
    """
    UPDATE Customers
    SET ContactName = 'Alfred Schmidt', City= 'Frankfurt'
    WHERE CustomerID = 1;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    UPDATE Customers
    SET ContactName='Juan'
    WHERE Country='Mexico';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    UPDATE Customers
    SET ContactName='Juan';
    """,
    "test2.db"
)

## SQL DELETE Statement

In [ ]:
execute_sql_db(
    """
    DELETE FROM Customers WHERE CustomerName='Alfreds Futterkiste';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    DELETE FROM data;
    """,
    "test.db"
)

In [ ]:
execute_sql_db(
    """
    DROP TABLE data;
    """,
    "test.db"
)

## SQL TOP, LIMIT, FETCH FIRST or ROWNUM Clause

In [ ]:
execute_sql_db(
    """
    SELECT * 
    FROM Customers
    LIMIT 3;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT *
    FROM Customers
    LIMIT (SELECT COUNT(*) * 0.5 FROM Customers);
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * 
    FROM Customers
    WHERE Country='Germany'
    LIMIT 3;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * 
    FROM Customers
    ORDER BY CustomerName DESC
    LIMIT 3;
    """,
    "test2.db"
)

# SQL Aggregate Functions

## SQL MIN() and MAX() Functions

In [ ]:
execute_sql_db(
    """
    SELECT MIN(Price)
    FROM Products;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT MAX(Price)
    FROM Products;
    """,
    "test2.db"
)

In [ ]:
# 쿼리 결과 컬럼 이름을 지정해줄 수 있음
execute_sql_db(
    """
    SELECT MIN(Price) AS SmallestPrice
    FROM Products;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT MIN(Price) AS SmallestPrice, CategoryID
    FROM Products
    GROUP BY CategoryID;
    """,
    "test2.db"
)

## SQL COUNT() Function

In [ ]:
execute_sql_db(
    """
    SELECT COUNT(*)
    FROM Products;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT COUNT(ProductName)
    FROM Products;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT COUNT(ProductID)
    FROM Products
    WHERE Price > 20;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT COUNT(DISTINCT Price)
    FROM Products;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT COUNT(*) AS [Number of records]
    FROM Products;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT COUNT(*) AS [Number of records], CategoryID
    FROM Products
    GROUP BY CategoryID;
    """,
    "test2.db"
)

## SQL SUM() Function

In [ ]:
execute_sql_db(
    """
    SELECT SUM(Quantity)
    FROM OrderDetails;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT SUM(Quantity)
    FROM OrderDetails
    WHERE ProductId = 11;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT SUM(Quantity) AS total
    FROM OrderDetails;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT OrderID, SUM(Quantity) AS [Total Quantity]
    FROM OrderDetails
    GROUP BY OrderID;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT SUM(Quantity * 10)
    FROM OrderDetails;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT SUM(Price * Quantity)
    FROM OrderDetails
    LEFT JOIN Products ON OrderDetails.ProductID = Products.ProductID;
    """,
    "test2.db"
)

## SQL AVG() Function

In [ ]:
execute_sql_db(
    """
    SELECT AVG(Price)
    FROM Products;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT AVG(Price)
    FROM Products
    WHERE CategoryID = 1;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT AVG(Price) AS [average price]
    FROM Products;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE price > (SELECT AVG(price) FROM Products);
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT AVG(Price) AS AveragePrice, CategoryID
    FROM Products
    GROUP BY CategoryID;
    """,
    "test2.db"
)

## SQL LIKE Operator

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE 'a%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE city LIKE 'L_nd__';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE city LIKE '%L%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE 'La%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE 'a%' OR CustomerName LIKE 'b%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE '%a';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE 'b%s';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE '%or%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE 'a__%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE '_r%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE Country LIKE 'Spain';
    """,
    "test2.db"
)

## SQL Wildcards

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE 'a%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE '%mer%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE City LIKE '_ondon';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE City LIKE 'L___on';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE '[bsp]%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE '[a-f]%';    
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE 'a__%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerName LIKE '_r%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE Country LIKE 'Spain';
    """,
    "test2.db"
)

## SQL IN Operator

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE Country IN ('Germany', 'France', 'UK');
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE Country NOT IN ('Germany', 'France', 'UK');
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerID IN (SELECT CustomerID FROM Orders);
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE CustomerID NOT IN (SELECT CustomerID FROM Orders);
    """,
    "test2.db"
)

## SQL BETWEEN Operator

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE Price BETWEEN 10 AND 20;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE Price NOT BETWEEN 10 AND 20;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE Price BETWEEN 10 AND 20
    AND CategoryID IN (1,2,3);
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE ProductName BETWEEN 'Carnarvon Tigers' AND 'Mozzarella di Giovanni'
    ORDER BY ProductName;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE ProductName BETWEEN "Carnarvon Tigers" AND "Chef Anton's Cajun Seasoning"
    ORDER BY ProductName;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE ProductName NOT BETWEEN 'Carnarvon Tigers' AND 'Mozzarella di Giovanni'
    ORDER BY ProductName;
    """,
    "test2.db"
)

In [ ]:
# #07/01/1996# AND #07/31/1996# 은 안되나봄
# execute_sql_db(
#     """
#     SELECT * FROM Orders
#     WHERE OrderDate BETWEEN #07/01/1996# AND #07/31/1996#;
#     """,
#     "test2.db"
# )

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Orders
    WHERE OrderDate BETWEEN '1996-07-01' AND '1996-07-31';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT CustomerID AS ID
    FROM Customers;
    """,
    "test2.db"
)

## SQL Aliases

In [ ]:
execute_sql_db(
    """
    SELECT CustomerID ID
    FROM Customers;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT CustomerID AS ID, CustomerName AS Customer
    FROM Customers;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT ProductName AS [My Great Products]
    FROM Products;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT ProductName AS "My Great Products"
    FROM Products;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT CustomerName, Address + ', ' + PostalCode + ' ' + City + ', ' + Country AS Address
    FROM Customers;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT CustomerName, CONCAT(Address,', ',PostalCode,', ',City,', ',Country) AS Address
    FROM Customers;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT CustomerName, (Address || ', ' || PostalCode || ' ' || City || ', ' || Country) AS Address
    FROM Customers;    
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers AS Persons;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT o.OrderID, o.OrderDate, c.CustomerName
    FROM Customers AS c, Orders AS o
    WHERE c.CustomerName='Around the Horn' AND c.CustomerID=o.CustomerID;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT Orders.OrderID, Orders.OrderDate, Customers.CustomerName
    FROM Customers, Orders
    WHERE Customers.CustomerName='Around the Horn' AND Customers.CustomerID=Orders.CustomerID;
    """,
    "test2.db"
)

## SQL Joins

In [ ]:
execute_sql_db(
    """
    SELECT Orders.OrderID, Customers.CustomerName, Orders.OrderDate
    FROM Orders
    INNER JOIN Customers ON Orders.CustomerID=Customers.CustomerID;
    """,
    "test2.db"
)

## SQL INNER JOIN

In [ ]:
execute_sql_db(
    """
    SELECT ProductID, ProductName, CategoryName
    FROM Products
    INNER JOIN Categories ON Products.CategoryID = Categories.CategoryID;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT Products.ProductID, Products.ProductName, Categories.CategoryName
    FROM Products
    INNER JOIN Categories ON Products.CategoryID = Categories.CategoryID;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT Products.ProductID, Products.ProductName, Categories.CategoryName
    FROM Products
    JOIN Categories ON Products.CategoryID = Categories.CategoryID;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT Orders.OrderID, Customers.CustomerName, Shippers.ShipperName
    FROM ((Orders
    INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID)
    INNER JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID);
    """,
    "test2.db"
)

## SQL LEFT JOIN Keyword

In [ ]:
execute_sql_db(
    """
    SELECT Customers.CustomerName, Orders.OrderID
    FROM Customers
    LEFT JOIN Orders ON Customers.CustomerID = Orders.CustomerID
    ORDER BY Customers.CustomerName;
    """,
    "test2.db"
)

## SQL RIGHT JOIN Keyword

In [ ]:
execute_sql_db(
    """
    SELECT Orders.OrderID, Employees.LastName, Employees.FirstName
    FROM Orders
    RIGHT JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
    ORDER BY Orders.OrderID;   
    """,
    "test2.db"
)

## SQL FULL OUTER JOIN Keyword

In [ ]:
execute_sql_db(
    """
    SELECT Customers.CustomerName, Orders.OrderID
    FROM Customers
    FULL OUTER JOIN Orders ON Customers.CustomerID=Orders.CustomerID
    ORDER BY Customers.CustomerName;
    """,
    "test2.db"
)

## SQL Self Join Example

In [ ]:
execute_sql_db(
    """
    SELECT A.CustomerName AS CustomerName1, B.CustomerName AS CustomerName2, A.City
    FROM Customers A, Customers B
    WHERE A.CustomerID <> B.CustomerID
    AND A.City = B.City
    ORDER BY A.City;
    """,
    "test2.db"
)

## SQL UNION Operator

In [ ]:
execute_sql_db(
    """
    SELECT City FROM Customers
    UNION
    SELECT City FROM Suppliers
    ORDER BY City;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT City FROM Customers
    UNION ALL
    SELECT City FROM Suppliers
    ORDER BY City;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT City, Country FROM Customers
    WHERE Country='Germany'
    UNION
    SELECT City, Country FROM Suppliers
    WHERE Country='Germany'
    ORDER BY City;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT City, Country FROM Customers
    WHERE Country='Germany'
    UNION ALL
    SELECT City, Country FROM Suppliers
    WHERE Country='Germany'
    ORDER BY City;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT 'Customer' AS Type, ContactName, City, Country
    FROM Customers
    UNION
    SELECT 'Supplier', ContactName, City, Country
    FROM Suppliers;
    """,
    "test2.db"
)

## SQL GROUP BY Statement

In [ ]:
execute_sql_db(
    """
    SELECT COUNT(CustomerID), Country
    FROM Customers
    GROUP BY Country;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT COUNT(CustomerID), Country
    FROM Customers
    GROUP BY Country
    ORDER BY COUNT(CustomerID) DESC;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT Shippers.ShipperName, COUNT(Orders.OrderID) AS NumberOfOrders FROM Orders
    LEFT JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID
    GROUP BY ShipperName;
    """,
    "test2.db"
)

## SQL HAVING Clause

In [ ]:
execute_sql_db(
    """
    SELECT COUNT(CustomerID), Country
    FROM Customers
    GROUP BY Country
    HAVING COUNT(CustomerID) > 5;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT COUNT(CustomerID), Country
    FROM Customers
    GROUP BY Country
    HAVING COUNT(CustomerID) > 5
    ORDER BY COUNT(CustomerID) DESC;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT Employees.LastName, COUNT(Orders.OrderID) AS NumberOfOrders
    FROM (Orders
    INNER JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID)
    GROUP BY LastName
    HAVING COUNT(Orders.OrderID) > 10;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT Employees.LastName, COUNT(Orders.OrderID) AS NumberOfOrders
    FROM Orders
    INNER JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
    WHERE LastName = 'Davolio' OR LastName = 'Fuller'
    GROUP BY LastName
    HAVING COUNT(Orders.OrderID) > 25;
    """,
    "test2.db"
)

## SQL EXISTS Operator

In [ ]:
execute_sql_db(
    """
    SELECT SupplierName
    FROM Suppliers
    WHERE EXISTS (SELECT ProductName FROM Products WHERE Products.SupplierID = Suppliers.supplierID AND Price < 20);
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT SupplierName
    FROM Suppliers
    WHERE EXISTS (SELECT ProductName FROM Products WHERE Products.SupplierID = Suppliers.supplierID AND Price = 22);
    """,
    "test2.db"
)

## SQL ANY and ALL Operators
### ANY 는 SQLite 에서 지원하지 않는다고 합니다

In [ ]:
execute_sql_db(
    """
    SELECT ProductName
    FROM Products
    WHERE ProductID = ANY
        (SELECT ProductID
        FROM OrderDetails
        WHERE Quantity = 10);
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT ProductName
    FROM Products
    WHERE ProductID = ANY
        (SELECT ProductID
        FROM OrderDetails
        WHERE Quantity > 99);
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT ProductName
    FROM Products
    WHERE ProductID = ANY
        (SELECT ProductID
        FROM OrderDetails
        WHERE Quantity > 1000);
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT ALL ProductName
    FROM Products
    WHERE TRUE;
    """,
    "test2.db"
)

In [ ]:
# execute_sql_db(
#     """
#     SELECT ProductName
#     FROM Products
#     WHERE ProductID = ALL
#         (SELECT ProductID
#         FROM OrderDetails
#         WHERE Quantity = 10);
#     """,
#     "test2.db"
# )

execute_sql_db(
    """
    SELECT ProductName
    FROM Products
    WHERE NOT EXISTS (
        SELECT ProductID
        FROM OrderDetails
        WHERE Quantity = 10
        AND ProductID NOT IN (SELECT ProductID FROM OrderDetails WHERE OrderDetails.ProductID = Products.ProductID));
    """,
    "test2.db"
)

# of course FALSE!!

## SQL SELECT INTO Statement
## The SQL INSERT INTO SELECT Statement

In [ ]:
execute_sql_db(
    """
    INSERT INTO Customers (CustomerName, City, Country)
    SELECT SupplierName, City, Country FROM Suppliers;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    INSERT INTO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
    SELECT SupplierName, ContactName, Address, City, PostalCode, Country FROM Suppliers;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    INSERT INTO Customers (CustomerName, City, Country)
    SELECT SupplierName, City, Country FROM Suppliers
    WHERE Country='Germany';
    """,
    "test2.db"
)

## SQL CASE Expression

In [ ]:
execute_sql_db(
    """
    SELECT OrderID, Quantity,
    CASE
        WHEN Quantity > 30 THEN 'The quantity is greater than 30'
        WHEN Quantity = 30 THEN 'The quantity is 30'
        ELSE 'The quantity is under 30'
    END AS QuantityText
    FROM OrderDetails;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT CustomerName, City, Country
    FROM Customers
    ORDER BY
    (CASE
        WHEN City IS NULL THEN Country
        ELSE City
    END);
    """,
    "test2.db"
)

## SQL Stored Procedures for SQL Server

In [ ]:
# SQLite 는 PROCEDURE 를 지원하이 않습니다.
execute_sql_db(
    """
    CREATE PROCEDURE SelectAllCustomers
    AS
    SELECT * FROM Customers
    GO;
    """,
    "test2.db"
)

In [ ]:
# SQLite 는 PROCEDURE 를 지원하이 않습니다.
execute_sql_db(
    """
    EXEC SelectAllCustomers;
    """,
    "test2.db"
)

In [ ]:
# SQLite 는 PROCEDURE 를 지원하이 않습니다.
execute_sql_db(
    """
    CREATE PROCEDURE SelectAllCustomers @City nvarchar(30)
    AS
    SELECT * FROM Customers WHERE City = @City
    GO;
    """,
    "test2.db"
)

In [ ]:
# SQLite 는 PROCEDURE 를 지원하이 않습니다.
execute_sql_db(
    """
    EXEC SelectAllCustomers @City = 'London';
    """,
    "test2.db"
)

In [ ]:
# SQLite 는 PROCEDURE 를 지원하이 않습니다.
execute_sql_db(
    """
    CREATE PROCEDURE SelectAllCustomers @City nvarchar(30), @PostalCode nvarchar(10)
    AS
    SELECT * FROM Customers WHERE City = @City AND PostalCode = @PostalCode
    GO;
    """,
    "test2.db"
)

In [ ]:
# SQLite 는 PROCEDURE 를 지원하이 않습니다.
execute_sql_db(
    """
    EXEC SelectAllCustomers @City = 'London', @PostalCode = 'WA1 1DP';
    """,
    "test2.db"
)

## SQL Comments

In [ ]:
execute_sql_db(
    """
    -- Select all:
    SELECT * FROM Customers;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers -- WHERE City='Berlin';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    -- SELECT * FROM Customers;
    SELECT * FROM Products;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    /*Select all the columns
    of all the records
    in the Customers table:*/
    SELECT * FROM Customers;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    /*SELECT * FROM Customers;
    SELECT * FROM Products;
    SELECT * FROM Orders;
    SELECT * FROM Categories;*/
    SELECT * FROM Suppliers;    
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT CustomerName, /*City,*/ Country FROM Customers;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers WHERE (CustomerName LIKE 'L%'
    OR CustomerName LIKE 'R%' /*OR CustomerName LIKE 'S%'
    OR CustomerName LIKE 'T%'*/ OR CustomerName LIKE 'W%')
    AND Country='USA'
    ORDER BY CustomerName;
    """,
    "test2.db"
)

## SQL Operators

In [ ]:
execute_sql_db(
    """
    SELECT 30 + 20;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT 30 - 20;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT 30 * 20;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT 30 / 10;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT 17 % 5;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT 17 & 5;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT 17 | 5;
    """,
    "test2.db"
)

In [ ]:
# SQLite 에서는 ^(xor)연산이 지원되지 않습니다.
execute_sql_db(
    """
    SELECT 17 ^ 5;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE Price = 18;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE Price > 30;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE Price < 30;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE Price >= 30;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE Price <= 30;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE Price <> 18;
    """,
    "test2.db"
)

In [ ]:
# sqlite 에서 ALL 연산은 지원되지 않습니다.
execute_sql_db(
    """
    SELECT ProductName 
    FROM Products
    WHERE ProductID = ALL (SELECT ProductID FROM OrderDetails WHERE Quantity = 10);
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE City = "London" AND Country = "UK";
    """,
    "test2.db"
)

In [ ]:
# sqlite 에서 ANY 연산은 지원되지 않습니다.
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE Price > ANY (SELECT Price FROM Products WHERE Price > 50);
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE Price BETWEEN 50 AND 60;
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT SupplierName
    FROM Suppliers
    WHERE EXISTS (SELECT ProductName FROM Products WHERE Products.SupplierID = Suppliers.supplierID AND Price < 20);
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE City IN ('Paris','London');
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE City LIKE 's%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE City NOT LIKE 's%';
    """,
    "test2.db"
)

In [ ]:
execute_sql_db(
    """
    SELECT * FROM Customers
    WHERE City = "London" OR Country = "UK";
    """,
    "test2.db"
)

In [ ]:
# sqlite 에서 SOME 함수는 지원되지 않습니다.
execute_sql_db(
    """
    SELECT * FROM Products
    WHERE Price > SOME (SELECT Price FROM Products WHERE Price > 20);
    """,
    "test2.db"
)